# Some Statistics with Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [3]:
#check if notebook runs in colab
import sys
IN_COLAB = 'google.colab' in sys.modules
print('running in Colab:',IN_COLAB)
path='..'
if IN_COLAB:
  #in colab, we need to clone the data from the repo
  !git clone https://github.com/keuperj/DataScienceSS20.git
  path='DataScienceSS20'

running in Colab: False

In [4]:
import pandas as pd

### Step 2. 
User ***Jupyter Lab*** to view ``path+"/DATA/US_Baby_Names_right.csv"``.

### Step 3. Assign it to a variable called baby_names.

In [5]:
baby_names = pd.read_csv(path+"/DATA/US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [72]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [78]:
baby_names.drop(columns=['Unnamed: 0', 'Id'], inplace=True)

### Step 6. Are there more male or female names in the dataset?

In [79]:
import numpy as np
baby_names['Gender'].value_counts().index.tolist()
RelativAges = np.array([[baby_names['Gender'].value_counts().index.tolist()],[baby_names['Gender'].value_counts()]])
print('There are more ', RelativAges[0][0][0], 'in the List')
RelativAges

There are more  F in the List

array([[['F', 'M']],

       [['558846', '457549']]], dtype='<U21')

In [ ]:
name_order = names.Count.aggregate(np.sum)
name_order = name_order.sort_values(ascending = False)
name_order.iloc[:20].plot(kind='bar', x='Name', y='Count')

### Step 7. Group the dataset by name and assign to names

In [83]:
names = baby_names.groupby(baby_names['Name'])
baby_names

            Name  Year Gender State  Count
0           Emma  2004      F    AK     62
1        Madison  2004      F    AK     48
2         Hannah  2004      F    AK     46
3          Grace  2004      F    AK     44
4          Emily  2004      F    AK     41
...          ...   ...    ...   ...    ...
1016390     Seth  2014      M    WY      5
1016391  Spencer  2014      M    WY      5
1016392     Tyce  2014      M    WY      5
1016393   Victor  2014      M    WY      5
1016394   Waylon  2014      M    WY      5

[1016395 rows x 5 columns]

### Step 8. How many different names exist in the dataset?

In [81]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [101]:
print(baby_names['Name'].value_counts().index.tolist()[0])
max(baby_names['Name'].value_counts())

Riley

1112

### Step 10. How many different names have the least occurrences?

In [169]:
import numpy as np
RelativName = np.array([baby_names['Name'].value_counts().index.tolist()])
RelativNameNr = np.array([baby_names['Name'].value_counts()])
NameLeastOccurrence = np.where((RelativNameNr == 1), 1, False)
N=NameLeastOccurrence.sum()
print("There are ", N ,"different Names and they are" ,RelativName[0][-N:]) #Warum hat das Array RelativName 2 dimensionen?

There are  3682 different Names and they are ['Aarika' 'Tobechukwu' 'Melida' ... 'Roston' 'Maebry' 'Azaliah']

    ### Step 11. What is the median name occurrence?

### Step 12. What is the standard deviation of names?

In [173]:
baby_names['Name'].value_counts().std()

122.02996350814088

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [175]:
print('Mean: ', baby_names['Name'].value_counts().mean())
print('min: ', baby_names['Name'].value_counts().min())
print('max: ', baby_names['Name'].value_counts().max())
print('Std: ', baby_names['Name'].value_counts().std())
print('Quartiles: ', baby_names['Name'].value_counts().quantile([0.25,0.75]))

Mean:  57.644906987295826
min:  1
max:  1112
Std:  122.02996350814088
Quartiles:  0.25     2.0
0.75    39.0
Name: Name, dtype: float64